#!/usr/bin/env bash
#
# Instalação da basica do meu Ambiente
#
# Site:       http://www.haroldosales.com
# Autor:     Haroldo Sales
# Manutenção: Haroldo Sales
#
# ------------------------------------------------------------------------ #
#  Este programa irá Listar
#
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 14/02/2021, Haroldo:
#       - Início do programa
#
# ------------------------------------------------------------------------ #
# Testado em:
#   bash 4.4.19
# ------------------------------------------------------------------------ #
# Agradecimentos:
#
# 	tive ideia nenhuma
# ------------------------------------------------------------------------ #

# ------------------------------- VARIÁVEIS ----------------------------------------- #

USUARIOS="$(/home/$user ls)"
MENSAGEM_USO="
  $(basename $0) - [OPÇÕES]

          -h - Menu de ajuda
          -v - Versão
          -s - LISTAR

  "
  VERSAO="v1.0"
  CHAVE_LISTAR=0



# ------------------------------------------------------------------------ #

# ------------------------------- TESTES ----------------------------------------- #

# ------------------------------------------------------------------------ #

# ------------------------------- FUNÇÕES ----------------------------------------- #
while test -n "$1"
do
  case "$1" in
     -h) echo "$MENSAGEM_USO"    && exit 0           ;;
     -v) echo "$VERSAO"          && exit 0           ;;
     -s) CHAVE_LISTAR=1                              ;;
    *) echo "Opção Invalida,  valie -h" && exit 1  ;;
  esac
  shift
done

[ $CHAVE_LISTAR  -eq 1 ] && USUARIOS=$(echo "$USUARIOS" | ls)


echo "$USUARIOS"
#---------------------------------------------------- #

# ------------------------------- EXECUÇÃO ----------------------------------------- #

# ------------------------------------------------------------------------ #
