#!/usr/bin/env bash

# ------------------VARIAVEIS-----------------------------------#
ARQUIVOS_CONF="configuracao.cf"
USAR_CORES=
USAR_MAISCULAS=
  MENSAGEM="oLA"

VERDE="\033[32;1m"
VERMELHO="\033[31;1m"


# ------------------------TESTE---------------------------------#
[ ! -r "$ARQUIVOS_CONF" ] && echo "sem confirmaçao" && exit 1

# --------------------------------------------------------------#


# -------------------FUNÇÕES------------------------------------#



# ---------------------------------------------------------------#

# ------------------------EXECUÇÃO-------------------------------#

while read -r linha
do
   [ "$(echo $linha | cut -c1)" = "#" ]  && continue
   [ ! "$linha"  ] && continue
echo "$linha"
done < "$ARQUIVOS_CONF"

# ---------------------------------------------------------------#

